# Данные из варианта 3
works_data = [
    # name, dependencies,       t_pes,  t_ver,  t_opt,  cost_reduction
    ('b1',  ['-'],              8,      6,      3,      4),
    ('b2',  ['-'],              6,      4,      2,      8),
    ('b3',  ['b1'],             13,     10,     6,      5),
    ('b4',  ['b1'],             4,      2,      1,      6),
    ('b5',  ['b4'],             5,      4,      2,      7),
    ('b6',  ['b2'],             10,     9,      4,      4),
    ('b7',  ['b2'],             6,      3,      1,      10),
    ('b8',  ['b7'],             9,      4,      2,      9),
    ('b9',  ['b5', 'b6', 'b8'], 10,     6,      3,      5),
    ('b10', ['b3', 'b4', 'b9'], 7,      5,      3,      8),
    ('b11', ['b5', 'b6', 'b8'], 11,     9,      5,      7)
]

T_dir = 26  # Директивный срок
gamma = 0.95  # Надежность
S_k = 10 # Стоимость одного дня проекта